stm32-hotspot/STM32N6-AI-Assistant-People-Detection/STM32Cube_FW_N6/Drivers/BSP/STM32N6570-DK/stm32n6570_ai_assistant_lcd.c
  /* Foreground Configuration */
  hlcd_dma2d.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
  hlcd_dma2d.LayerCfg[1].InputAlpha = 0xFF;
  hlcd_dma2d.LayerCfg[1].InputColorMode = ColorMode;
  hlcd_dma2d.LayerCfg[1].InputOffset = 0;

  hlcd_dma2d.Instance = DMA2D;

  /* DMA2D Initialization */
  if(HAL_DMA2D_Init(&hlcd_dma2d) == HAL_OK)
  {
    if(HAL_DMA2D_ConfigLayer(&hlcd_dma2d, 1) == HAL_OK)
    {
      if (HAL_DMA2D_Start(&hlcd_dma2d, (uint32_t)pSrc, (uint32_t)pDst, xSize, 1) == HAL_OK)
      {
        /* Polling For DMA transfer */
        (void)HAL_DMA2D_PollForTransfer(&hlcd_dma2d, 50);
      }
    }
  }
}

#define SOFTSPI_CS_START          HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_RESET)
#define SOFTSPI_CS_END            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5, GPIO_PIN_SET)

#define SOFTSPI_DATA_0            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_3, GPIO_PIN_RESET)
#define SOFTSPI_DATA_1            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_3, GPIO_PIN_SET)

#define SOFTSPI_CLK_LOW           HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_RESET)
#define SOFTSPI_CLK_HIGH          HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET)

static void softspi_send_cmd(uint8_t cmd){
	uint8_t mask;

	/* D/C -> low */
	SOFTSPI_CLK_LOW;
	SOFTSPI_DATA_0;
	SOFTSPI_CS_START;
#ifndef DELAY_BY_NOPS
	HAL_Delay(1);
#else
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
#endif

	SOFTSPI_CLK_HIGH;
#ifndef DELAY_BY_NOPS
	HAL_Delay(1);
#else
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
#endif

	/* bit 7 .. 0 */
	for(mask=0x80; mask>0; mask>>=1){
		SOFTSPI_CLK_LOW;
		if(cmd & mask){
			SOFTSPI_DATA_1;
		}else{
			SOFTSPI_DATA_0;
		}
#ifndef DELAY_BY_NOPS
		HAL_Delay(1);
#else
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
#endif

		SOFTSPI_CLK_HIGH;
#ifndef DELAY_BY_NOPS
		HAL_Delay(1);
#else
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
#endif
	}

	SOFTSPI_CLK_LOW;
	SOFTSPI_CS_END;
#ifndef DELAY_BY_NOPS
	HAL_Delay(1);
#else
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
#endif
	SOFTSPI_CLK_HIGH;
	SOFTSPI_DATA_1;
}

static void softspi_send_data(uint8_t data){
	uint8_t mask;

	/* D/C -> high */
	SOFTSPI_CLK_LOW;
	SOFTSPI_DATA_1;
	SOFTSPI_CS_START;
#ifndef DELAY_BY_NOPS
	HAL_Delay(1);
#else
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
#endif

	SOFTSPI_CLK_HIGH;
#ifndef DELAY_BY_NOPS
	HAL_Delay(1);
#else
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
#endif

	/* bit 7 .. 0 */
	for(mask=0x80; mask>0; mask>>=1){
		SOFTSPI_CLK_LOW;
		if(data & mask){
			SOFTSPI_DATA_1;
		}else{
			SOFTSPI_DATA_0;
		}
#ifndef DELAY_BY_NOPS
		HAL_Delay(1);
#else
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
#endif

		SOFTSPI_CLK_HIGH;
#ifndef DELAY_BY_NOPS
		HAL_Delay(1);
#else
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
		__asm__("nop");
#endif
	}


	SOFTSPI_CLK_LOW;
	SOFTSPI_CS_END;
#ifndef DELAY_BY_NOPS
	HAL_Delay(1);
#else
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
	__asm__("nop");
#endif
	SOFTSPI_CLK_HIGH;
	SOFTSPI_DATA_1;
}

static void softspi_msp_init(void){
	/*
	 * 3lines Soft-SPI
	 * PC0 - CLK
	 * PC3 - DATA
	 * PC5 - CS
	 */
	GPIO_InitTypeDef  gpio_init_structure = {0};

	__HAL_RCC_GPIOC_CLK_ENABLE();

    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH; //GPIO_SPEED_FREQ_LOW;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;

    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_5;
    gpio_init_structure.Alternate = GPIO_AF0_SYS;
    HAL_GPIO_Init(GPIOC, &gpio_init_structure);

    HAL_PWREx_DisableVddIO5RangeSTBY();
    HAL_PWREx_ConfigVddIORange(PWR_VDDIO5, PWR_VDDIO_RANGE_1V8);
    HAL_PWREx_EnableVddIO5();

    SOFTSPI_CS_END;
    SOFTSPI_DATA_1;
    SOFTSPI_CLK_HIGH;
}

static void softspi_configure(void){
	HAL_Delay(10);

	softspi_send_cmd(0x11);

	HAL_Delay(120); //HAL_Delay 120ms



	softspi_send_cmd(0xFF);

	softspi_send_data(0x77);

	softspi_send_data(0x01);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x10);



	softspi_send_cmd(0xC0);

	softspi_send_data(0x3B);

	softspi_send_data(0x00);



	softspi_send_cmd(0xC1);

	softspi_send_data(0x0D);

	softspi_send_data(0x02);



	softspi_send_cmd(0xC2);

	softspi_send_data(0x21);

	softspi_send_data(0x08);



	softspi_send_cmd(0xCD);

	softspi_send_data(0x08);





	softspi_send_cmd(0xB0);

	softspi_send_data(0x00);

	softspi_send_data(0x11);

	softspi_send_data(0x18);

	softspi_send_data(0x0E);

	softspi_send_data(0x11);

	softspi_send_data(0x06);

	softspi_send_data(0x07);

	softspi_send_data(0x08);

	softspi_send_data(0x07);

	softspi_send_data(0x22);

	softspi_send_data(0x04);

	softspi_send_data(0x12);

	softspi_send_data(0x0F);

	softspi_send_data(0xAA);

	softspi_send_data(0x31);

	softspi_send_data(0x18);



	softspi_send_cmd(0xB1);

	softspi_send_data(0x00);

	softspi_send_data(0x11);

	softspi_send_data(0x19);

	softspi_send_data(0x0E);

	softspi_send_data(0x12);

	softspi_send_data(0x07);

	softspi_send_data(0x08);

	softspi_send_data(0x08);

	softspi_send_data(0x08);

	softspi_send_data(0x22);

	softspi_send_data(0x04);

	softspi_send_data(0x11);

	softspi_send_data(0x11);

	softspi_send_data(0xA9);

	softspi_send_data(0x32);

	softspi_send_data(0x18);



	softspi_send_cmd(0xFF);



	softspi_send_data(0x77);

	softspi_send_data(0x01);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x11);



	softspi_send_cmd(0xB0);

	softspi_send_data(0x60);



	softspi_send_cmd(0xB1);

	softspi_send_data(0x30);



	softspi_send_cmd(0xB2);

	softspi_send_data(0x87);



	softspi_send_cmd(0xB3);

	softspi_send_data(0x80);



	softspi_send_cmd(0xB5);

	softspi_send_data(0x49);



	softspi_send_cmd(0xB7);

	softspi_send_data(0x85);



	softspi_send_cmd(0xB8);

	softspi_send_data(0x21);



	softspi_send_cmd(0xC1);

	softspi_send_data(0x78);



	softspi_send_cmd(0xC2);

	softspi_send_data(0x78);



