stm32-hotspot/STM32N6-AI-Assistant-People-Detection/STM32Cube_FW_N6/Drivers/BSP/STM32N6570-DK/stm32n6570_ai_assistant_lcd.c
	HAL_Delay(20);

	softspi_send_cmd(0xE0);

	softspi_send_data(0x00);

	softspi_send_data(0x1B);

	softspi_send_data(0x02);



	softspi_send_cmd(0xE1);

	softspi_send_data(0x08);

	softspi_send_data(0xA0);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x07);

	softspi_send_data(0xA0);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x44);

	softspi_send_data(0x44);



	softspi_send_cmd(0xE2);

	softspi_send_data(0x11);

	softspi_send_data(0x11);

	softspi_send_data(0x44);

	softspi_send_data(0x44);

	softspi_send_data(0xED);

	softspi_send_data(0xA0);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0xEC);

	softspi_send_data(0xA0);

	softspi_send_data(0x00);

	softspi_send_data(0x00);



	softspi_send_cmd(0xE3);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x11);

	softspi_send_data(0x11);



	softspi_send_cmd(0xE4);

	softspi_send_data(0x44);

	softspi_send_data(0x44);



	softspi_send_cmd(0xE5);

	softspi_send_data(0x0A);

	softspi_send_data(0xE9);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);

	softspi_send_data(0x0C);

	softspi_send_data(0xEB);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);

	softspi_send_data(0x0E);

	softspi_send_data(0xED);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);

	softspi_send_data(0x10);

	softspi_send_data(0xEF);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);



	softspi_send_cmd(0xE6);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x11);

	softspi_send_data(0x11);



	softspi_send_cmd(0xE7);

	softspi_send_data(0x44);

	softspi_send_data(0x44);



	softspi_send_cmd(0xE8);

	softspi_send_data(0x09);

	softspi_send_data(0xE8);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);

	softspi_send_data(0x0B);

	softspi_send_data(0xEA);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);

	softspi_send_data(0x0D);

	softspi_send_data(0xEC);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);

	softspi_send_data(0x0F);

	softspi_send_data(0xEE);

	softspi_send_data(0xD8);

	softspi_send_data(0xA0);



	softspi_send_cmd(0xEB);

	softspi_send_data(0x02);

	softspi_send_data(0x00);

	softspi_send_data(0xE4);

	softspi_send_data(0xE4);

	softspi_send_data(0x88);

	softspi_send_data(0x00);

	softspi_send_data(0x40);



	softspi_send_cmd(0xEC);

	softspi_send_data(0x3C);

	softspi_send_data(0x00);



	softspi_send_cmd(0xED);

	softspi_send_data(0xAB);

	softspi_send_data(0x89);

	softspi_send_data(0x76);

	softspi_send_data(0x54);

	softspi_send_data(0x02);

	softspi_send_data(0xFF);

	softspi_send_data(0xFF);

	softspi_send_data(0xFF);

	softspi_send_data(0xFF);

	softspi_send_data(0xFF);

	softspi_send_data(0xFF);

	softspi_send_data(0x20);

	softspi_send_data(0x45);

	softspi_send_data(0x67);

	softspi_send_data(0x98);



	softspi_send_data(0xBA);

	softspi_send_cmd(0xFF);

	softspi_send_data(0x77);

	softspi_send_data(0x01);

	softspi_send_data(0x00);

	softspi_send_data(0x00);

	softspi_send_data(0x00);


	/* Display Brightness */
	softspi_send_cmd(0x51);
	softspi_send_data(0xF0);

	/* CTRL Display */
	softspi_send_cmd(0x53);
	softspi_send_data(0x2C);


	softspi_send_cmd(0x36);

	softspi_send_data(0x00); //08

	softspi_send_cmd(0x3A); /* Interface Pixel Format */

	softspi_send_data(0x66); /* 18-bit/pixel */


	softspi_send_cmd(0x21); //


	HAL_Delay (120);

	softspi_send_cmd(0x29);

	/* disable VddIO5 to save power */
    HAL_PWREx_EnableVddIO5RangeSTBY();
    HAL_PWREx_DisableVddIO5();
}

/**
  * @brief  Initialize the BSP LTDC Msp.
  * @param  hltdc  LTDC handle
  * @retval None
  */
static void LTDC_MspInit(LTDC_HandleTypeDef *hltdc)
{
  GPIO_InitTypeDef  gpio_init_structure = {0};

  if (hltdc->Instance == LTDC)
  {
    __HAL_RCC_LTDC_CLK_ENABLE();

    __HAL_RCC_LTDC_FORCE_RESET();
    __HAL_RCC_LTDC_RELEASE_RESET();

    /* STM32N6570-DK MB1860A RK050HR18 */
    /* PG0  R0          */
    /* PD9  R1          */
    /* PD15 R2          */
    /* PB4  R3          */ // JTAG
    /* PH4  R4          */
    /* PA15 R5          */ // JTAG JTDI
    /* PG11 R6          */
    /* PD8  R7          */
    /* PG12 G0          */
    /* PG1  G1          */
    /* PA1  G2          */
    /* PA0  G3          */
    /* PB15 G4          */
    /* PB12 G5          */
    /* PB11 G6          */
    /* PG8  G7          */
    /* P15  B0          */
    /* PA7  B1          */
    /* PB2  B2          */
    /* PG6  B3          */
    /* PH3  B4          */
    /* PH6  B5          */
    /* PA8  B6          */
    /* PA2  B7          */
    /*                  */
    /* PG13 LCD_DE      */
    /* PQ3  LCD_ONOFF   */
    /* PB14 LCD_HSYNC   */
    /* PE11 PCD_VSYNC   */
    /* PB13 LCD_CLK     */
    /* PQ4  LCD_INT     */
    /* PQ6  LCD_BL_CTRL */
    /* PG3  NRST        */

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();
    __HAL_RCC_GPIOQ_CLK_ENABLE();

    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_HIGH;

    /* G3, G2, B7, B1, B6, R5 */
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_15;
    gpio_init_structure.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOA, &gpio_init_structure);

    /* LCD_CLK, LCD_HSYNC B2, R3, G6, G5, G4 */
    gpio_init_structure.Pin       = GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_2 | GPIO_PIN_4 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_15;
    gpio_init_structure.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOB, &gpio_init_structure);

    /* R7, R1, R2 */
    gpio_init_structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_15;
    gpio_init_structure.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOD, &gpio_init_structure);

    /* LCD_VSYNC */
    gpio_init_structure.Pin       = GPIO_PIN_11;
    gpio_init_structure.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOE, &gpio_init_structure);

    /* R0, G1, B3, G7, R6, G0 */
    gpio_init_structure.Pin       = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_6 | GPIO_PIN_8 | GPIO_PIN_11 | GPIO_PIN_12 ;
    gpio_init_structure.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOG, &gpio_init_structure);

    /* B4, R4, B5 */
    gpio_init_structure.Pin       = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_6;
    gpio_init_structure.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOH, &gpio_init_structure);

